app/controllers/comments_controller.rb

def create
	 @comment = Comment.new(comment_params)
	 @comment.save
---
INSERT INTO `comments` (`content`, `created_at`, `email`, `issue_id`, `updated_at`, `username`) VALUES ('123456', '2015-03-25 13:43:38', 'zhaolei7390145@qq.com', 4, '2015-03-25 13:43:38', '恩恩')