app/controllers/issues_controller.rb

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 1 LIMIT 1
---
  def show
  	 @issue = Issue.find(params[:id])

INSERT INTO `issues` (`content`, `created_at`, `title`, `updated_at`, `user_id`) VALUES ('一起happy~', '2015-03-27 09:10:08', '明天去露营！', '2015-03-27 09:10:08', 5)
---
def create
  Issue.create(issue_params)

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 1 LIMIT 1
DELETE FROM `issues` WHERE `issues`.`id` = 1
---
  def destroy
    i = Issue.find(params[:id])
    i.destroy

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 2 LIMIT 1
---
  def edit
  @issue = Issue.find(params[:id])

SELECT  `issues`.* FROM `issues`  WHERE `issues`.`id` = 2 LIMIT 1
UPDATE `issues` SET `content` = 'Lorem ipsum d48965', `updated_at` = '2015-03-25 12:50:03' WHERE `issues`.`id` = 2
---
def update
  i = Issue.find(params[:id])
  i.update_attributes(issue_params)