app/controllers/page_controller.rb

SELECT `issues`.* FROM `issues`
---
  def welcome

  @issues  = Issue.all.reverse