app/controllers/users_controller.rb

  def create
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO `users` (`auth_token`, `created_at`, `email`, `name`, `password_digest`, `updated_at`) VALUES ('HwmR6YcmeXv-AciQCAjV0A', '2015-03-26 16:15:24', '123@qq.com', 'zhaolei5', '$2a$10$La/UItyHMi0VC7OtnOzQ2OZwRZ.rmXa7bTWcLphMzg/Wn4Z5jTyNW', '2015-03-26 16:15:24')

def create_login_session
  user = User.find_by_name(params[:name])
---
SELECT  `users`.* FROM `users`  WHERE `users`.`name` = 'zhaolei7390145@qq.com' LIMIT 1